app/controllers/songs_controller.rb

  def index

    if params[:artist_id]
      if @artist = Artist.find_by_id(params[:artist_id])
        @songs = @artist.songs
      else
        redirect_to artists_path
        flash[:alert] = "Artist not found."
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    @song = Song.find(params[:id])
    @artist = @song.artist

  if !@artist.songs.includes(@song)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 3], ["id", nil], ["LIMIT", 1]]